/**
 * @BY_YANDEX
 * 
 * Задача 5 Даны даты заезда и отъезда каждого гостя. 
 * Для каждого гостя дата заезда строго раньше даты отъезда 
 * (то есть каждый гость останавливается хотя бы на одну ночь).
 * В пределах одного дня считается, что сначала старые Rocha выезжают, а затем въезжают новые. 
 * Найти максимальное число постояльцев, которые одновременно проживали 
 * в гостинице (считаем, что измерение количества постояльцев происходит в конце дня).
 * 
 * @sample = [ (1, 2), (1, 3), (2, 4), (2, 3), ]
 */
