/*
Имея две разные позиции на шахматной доске, найдите наименьшее количество ходов, 
которое потребуется коню, чтобы добраться из одной в другую. Позиции будут переданы как два аргумента в алгебраической записи. 
Например, knight("a3", "b5")должен вернуть 1.

Коню не разрешается выходить за пределы доски. Доска 8х8.

Информацию о ходах конем см. на странице https://en.wikipedia.org/wiki/Knight_%28chess%29 .

Для получения информации об алгебраической нотации см. https://en.wikipedia.org/wiki/Algebraic_notation_%28chess%29 .

(Предупреждение: многие тесты были сгенерированы случайным образом. Если какие-то из них не работают, тестовые 
примеры вернут входные, выходные и ожидаемые выходные данные; опубликуйте их.)
*/
